print("Бірінші тапсырма    ")
a=int(input("Бірінші санды енгізіңіз:  "))
b=int(input("Екінші санды енгізіңіз:  "))   
S=(a**2)+(2*a*b)+(b**2)
print(f"({a}+{b})^2"+"="+str(S))
S1=(a+b)**2
if S==S1: 
    print("Теңдік орындалды") 
else: 
    print("Теңдік орындалмады")


print("Екінші тапсырма    ")
S=(a-b)**3
S1=(a**3)-(3*(a**2)*b)+(3*a*(b**2))-(b**3)
print(f"({a}-{b})^3"+"="+str(S))
S1=(a-b)**3         
if S==S1: 
    print("Теңдік орындалды") 
else: 
    print("Теңдік орындалмады")      

print("Үшінші тапсырма    ")
S=(a+b)*(a**2-a*b+b**2)
print(f"{a**3}+{b**3}="+str(S)) 
S1=a**3+b**3        
if S==S1: 
    print("Теңдік орындалды")   
else: 
    print("Теңдік орындалмады") 

